from mimetypes import init


class Emessage:
    def __init__(self,firstname,lastname,job):
        self.firstname = firstname
        self.lastname = lastname
        self.job = job

    def welcomemessage(self):

        return """
            عزيزي / عزيزتي ( """+self.firstname+"""   """ + self.lastname+""") 
            تـحـيــة طيبـة وبـعـد،
            نشكـر حضرتكم لتقـديم طلب توظيف فـي شركة منير سختيان
            و نود إعلام حضرتكم  أنه قد تم إستلام طلبكم من قبلنا و أنه قيد الفرز و التدقيق, و سوف نقوم بموافاتكم بمدى إمكانية إدراج  الطلب في قاعدة البيانات الخاصة بشركتنا من خلال البريد الإلكتروني و ذلك خلال فترة  ثلاثة أسابيع  من تاريخه. 
            """  
    def firstinterview(self):
        return """
            عزيزي/ عزيزتي (""" + self.lastname+""" """ +self.firstname+""") 
            تـحـيــة طيبـة وبـعـد،
            نشكر لكم إهتمامكم بتقديم طلب توظيف لدى شركة "منير سختيان" حيث تسعى الشركة  دائما لتشجيع وضم أفضل  الكوادر المؤهلة لفريقها المتميز  و ذلك بطريقة علمية و مهنية , و من أجل إتاحة الفرص المتساوية للجميع و حيث أن المقابلة الشخصية تعتبر الخطوة الأولى في هذه المسيرة  ، يسرنا دعوتكم لمقابلة شخصية مبدئية مع  اللجنة المختصة لدينا وذلك للنظر في مدى توافق  وظيفة  """ + +self.job+""" مع ما لديكم من مؤهلات علمية و عملية و ذلك في تاريخ  """+self.date+"""و ذلك في الساعة  """+self.hour+"""
            ملاحظة : يرجى من حضرتكم احضار صور عن الشهادات العلمية وشهادات الخبرة ان وجدت .

        """
        


